<?php
$a[] = "25 ***_**_**  life:)";
$a[] = "33 ***_**_**  MTC";
$a[] = "44 ***_**_**  Velcom";
$a[] = "29 1**_**_**  Velcom";
$a[] = "29 2**_**_**  MTC";
$a[] = "29 3**_**_**  Velcom";
$a[] = "29 5**_**_**  MTC";
$a[] = "29 6**_**_**  Velcom";
$a[] = "29 7**_**_**  MTC";
$a[] = "29 8**_**_**  MTC";
$a[] = "29 9**_**_**  Velcom";
$a[] = "15 ***_**_** Гродненская область";
$a[] = "16 ***_**_** Брестская область";
$a[] = "17 ***_**_** Минская область";
$a[] = "21 ***_**_** Витебская область";
$a[] = "22 ***_**_** Могилевская область";
$a[] = "23 ***_**_** Гомельская область";
$q = isset($_REQUEST["q"]) ? $_REQUEST["q"] : "";
$hint = "";
if($q !== "") {
    $len = strlen($q);
    foreach ($a as $phone) {
        if(strstr($q, mb_substr($phone, 0, $len))) {
            if($hint === "") {
                $hint = $phone;
            } else {
                $hint .= "<br> $phone";
            }
        }
    }
}
echo $hint === "" ? "Нет вариантов" : $hint;
?>